
**** DONE begin learning and working
     CLOSED: [2016-08-02 Tue 05:13]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-02 Tue 05:13]
     CLOCK: [2016-08-02 二 05:02]--[2016-08-02 Tue 05:13] =>  0:11

     :END:
重装spacemacs
载入出现文件目录错误，重新安装ya...解决
还有一错误ispell
用M-x install package 两遍排队错误

**** DONE relaxing and browing
     CLOSED: [2016-08-02 Tue 07:01]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-02 Tue 07:01]
     CLOCK: [2016-08-02 Tue 06:49]--[2016-08-02 Tue 07:01] =>  0:12
     :END:

**** DONE begin learning and work
     CLOSED: [2016-08-02 Tue 11:28]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-02 Tue 11:28]
     CLOCK: [2016-08-02 Tue 08:09]--[2016-08-02 Tue 08:11] =>  0:02
     :END:

**** DONE 重新安装spacemacs
     CLOSED: [2016-08-02 Tue 19:08]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-02 Tue 19:08]
     CLOCK: [2016-08-02 Tue 18:50]--[2016-08-02 Tue 19:08] =>  0:18
     :END:
日记文件不指向journal.org 仍指向!journal.org
不知何故。
**** DONE begin learning and working
     CLOSED: [2016-08-03 Wed 06:36]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-03 Wed 06:36]
     CLOCK: [2016-08-03 Wed 04:19]--[2016-08-03 Wed 04:24] =>  0:05
     :END:

**** DONE begin learning and working
     CLOSED: [2016-08-04 Thu 07:01]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-04 Thu 07:01]
     CLOCK: [2016-08-04 Thu 03:46]--[2016-08-04 Thu 03:48] =>  0:02
     :END:
**** DONE 深思与总结
     CLOSED: [2016-08-05 Fri 11:16]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-05 Fri 11:16]
     CLOCK: [2016-08-05 Fri 08:54]--[2016-08-05 Fri 11:16] =>  2:22
     :END:
3850 characters
**** DONE 今天早上3：00起。
     CLOSED: [2016-08-06 Sat 10:18]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-06 Sat 10:18]
     CLOCK: [2016-08-06 Sat 10:17]--[2016-08-06 Sat 10:18] =>  0:01
     :END:
到车里复习三课。温故知新。真理。
知识学习到永远不忘才算完成。
特别是语言，达到听懂、会写、熟用。才行
不求快。只求会。
8:40给物业打电话，来修下水。最报还是自己做的。不过把手弄破了。以后要千万小心。活只能让别人干。
淋溶头移位完成。
其它已发短信给房主。没回。再落实。
**** DONE relax and listening Engish songs
     CLOSED: [2016-08-08 Mon 07:03]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-08 Mon 07:03]
     CLOCK: [2016-08-08 Mon 06:27]--[2016-08-08 Mon 07:03] =>  0:36
     :END:

**** DONE notes
     CLOSED: [2016-08-08 一 11:49]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-08 一 11:49]
     CLOCK: [2016-08-08 一 11:21]--[2016-08-08 一 11:49] =>  0:28
     :END:
作者：Bird Frank
链接：http://www.zhihu.com/question/19712884/answer/49422221
来源：知乎
著作权归作者所有，转载请联系作者获得授权。

我基本没有使用过vim，因此只针对Emacs的情况来说。其实最初是想针对
为什么有的程序员极度推崇 Vim 和 Emacs，却对 IDE 嗤之以鼻？?? - 编程这个问题进行
回答的，但是第一，我并不会对任何IDE或使用IDE的人“嗤之以鼻”，其次我也不认为一个认真的
Emacs用户会对IDE嗤之以鼻，因此就没法回答这个以“为什么”开头的问题了。后来发现我
想说的内容针对现在这个问题更合适，所以就发到这里来啦。


先说说Emacs和IDE比较的问题。Emacs不是一个简单的文本编辑器，能做到事情远远超过IDE。
如果只用Emacs来编写代码，那么相当于拿了一把瑞士军刀却只用它的主刀片。


说说我自己吧，以前我用Eclipse写J2EE软件，后来用Textmate写RoR软件；用Word写文档，
还要一个工具来画UML图，导出成图片后再插入Word文档。到了Mac上以后改用Pages，流程
还是差不多。用Evernote记笔记，用过一些GTD的软件来做任务管理，尝试过几次写博客，
都是在浏览器里直接编辑的那种。


目前这些任务都在Emacs里完成啦：

+ RoR的代码自然在Emacs里完成，前两个月刚在Emacs里配了Android的开发环境开始学习
  Android。iOS的软件还是用xCode，主要因为目前基本不做iOS的开发，只是偶尔看看别人
  的代码，做些小修改，因此暂时没有在Emacs里配开发环境。

+ 技术文档用org-mode写，然后导出成PDF；UML图用PlantUML画，在org-mode里一气呵成，
  再也不用在不同软件间倒来倒去了。而且可以在文档里插入带语法高亮的源代码，这一点
  我现在也不知道怎么在Word或Pages来实现。

+ Evernote的编辑功能实在太弱，又不支持Markdown，因此目前正在逐渐用org-mode来代替。
  用了deft插件，搜索笔记非常方便。

+ 博客的话用jekyll，自然也是在Emacs里用Markdown写，然后再发布到github上。这个答
  案就是在Emacs里写的，稍后只要做下```git push```就可以发布到我的博客上去了。

+ 任务管理也是用org-mode，接下去准备尝试把日程管理也从Calendar切换到org-mode来。

所有这些任务都有一个共同点，就是他们都有很多文字输入和编辑工作。如果象以前那样要
用不同软件来完成的话，每个软件的编辑功能多少都有些不同，强弱差别非常大。而统一使
用Emacs以后，虽然Emacs的学习曲线有些陡，但是只要学会了以后，在所有这些任务中都能
用到。而且因为专注一个软件，每天大量的时间使用它，很快就很学会和数量使用了。


Emacs有强大的定制功能，可以完全根据个人的习惯、喜好来把它“调教”成个人专属的功
能。而且这种“定制化”的投资对于上述的所有任务都有价值，投资回报超高。


可以说使用Emacs完成的任务越多，用在学习和定制化上的“投资”就越有价值。

使用Emacs的另一个原因是为了贯彻KISS（Keep It Simple）原则。有人可能觉得Emacs超复
杂，并且因此而望而却步，不愿意去学习它。但是一旦学会了，用一个Emacs来代替一堆其
它软件的时候，你就会发现生活一下子简单了很多。不再需要面对很多软件上面那些根本不
会用到的菜单、按钮，而只专注于完成日常任务所需要的那些最常用的功能上，然后用最有
效率的方式去完成它们。

作者：Bird Frank
链接：http://www.zhihu.com/question/19712884/answer/49422221
来源：知乎
著作权归作者所有，转载请联系作者获得授权。

我基本没有使用过vim，因此只针对Emacs的情况来说。其实最初是想针对
为什么有的程序员极度推崇 Vim 和 Emacs，却对 IDE 嗤之以鼻？?? - 编程这个问题进行
回答的，

但是第一，我并不会对任何IDE或使用IDE的人“嗤之以鼻”，其次我也不认为一个认真的
Emacs用户会对IDE嗤之以鼻，因此就没法回答这个以“为什么”开头的问题了。后来发现我
想说的内容针对现在这个问题更合适，所以就发到这里来啦。


先说说Emacs和IDE比较的问题。Emacs不是一个简单的文本编辑器，能做到事情远远超过IDE。
如果只用Emacs来编写代码，那么相当于拿了一把瑞士军刀却只用它的主刀片。


说说我自己吧，以前我用Eclipse写J2EE软件，后来用Textmate写RoR软件；用Word写文档，
还要一个工具来画UML图，导出成图片后再插入Word文档。到了Mac上以后改用Pages，流程
还是差不多。用Evernote记笔记，用过一些GTD的软件来做任务管理，尝试过几次写博客，
都是在浏览器里直接编辑的那种。


目前这些任务都在Emacs里完成啦：

+ RoR的代码自然在Emacs里完成，前两个月刚在Emacs里配了Android的开发环境开始学习
  Android。iOS的软件还是用xCode，主要因为目前基本不做iOS的开发，只是偶尔看看别人
  的代码，做些小修改，因此暂时没有在Emacs里配开发环境。
+ 技术文档用org-mode写，然后导出成PDF；UML图用PlantUML画，在org-mode里一气呵成，
  再也不用在不同软件间倒来倒去了。而且可以在文档里插入带语法高亮的源代码，这一点
  我现在也不知道怎么在Word或Pages来实现。
+ Evernote的编辑功能实在太弱，又不支持Markdown，因此目前正在逐渐用org-mode来代替。
  用了deft插件，搜索笔记非常方便。
+ 博客的话用jekyll，自然也是在Emacs里用Markdown写，然后再发布到github上。这个答
  案就是在Emacs里写的，稍后只要做下```git push```就可以发布到我的博客上去了。
+ 任务管理也是用org-mode，接下去准备尝试把日程管理也从Calendar切换到org-mode来。

所有这些任务都有一个共同点，就是他们都有很多文字输入和编辑工作。如果象以前那样要
用不同软件来完成的话，每个软件的编辑功能多少都有些不同，强弱差别非常大。而统一使
用Emacs以后，虽然Emacs的学习曲线有些陡，但是只要学会了以后，在所有这些任务中都能
用到。而且因为专注一个软件，每天大量的时间使用它，很快就很学会和数量使用了。


Emacs有强大的定制功能，可以完全根据个人的习惯、喜好来把它“调教”成个人专属的功
能。而且这种“定制化”的投资对于上述的所有任务都有价值，投资回报超高。


可以说使用Emacs完成的任务越多，用在学习和定制化上的“投资”就越有价值。

使用Emacs的另一个原因是为了贯彻KISS（Keep It Simple）原则。有人可能觉得Emacs超复
杂，并且因此而望而却步，不愿意去学习它。但是一旦学会了，用一个Emacs来代替一堆其
它软件的时候，你就会发现生活一下子简单了很多。不再需要面对很多软件上面那些根本不
会用到的菜单、按钮，而只专注于完成日常任务所需要的那些最常用的功能上，然后用最有
效率的方式去完成它们。

http://link.zhihu.com/?target=http%3A//www.cnblogs.com/zhuweisky/p/4811408.html
**** DONE 友杰到家商谈事情
     CLOSED: [2016-08-11 四 21:49]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-11 四 21:49]
     CLOCK: [2016-08-11 四 19:43]--[2016-08-11 四 21:00] =>  1:17
     - State "STARTED"    from "DONE"       [2016-08-11 四 21:43]
     :END:
     - State "DONE"       from "STARTED"    [2016-08-11 四 21:43]
**** DONE browers and search
     CLOSED: [2016-08-16 二 05:56]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-16 二 05:56]
     CLOCK: [2016-08-16 二 05:19]--[2016-08-16 二 05:56] =>  0:02
     :END:
Done it is better than profact.
**** DONE 陪同夫人孩子购物
     CLOSED: [2016-08-16 二  17:47]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-16 二 18:03]
     CLOCK: [2016-08-16 二 14:02]--[2016-08-16 二 17:47] =>  3:45
     :END:

累啊，在车里休息了一会。
****** DONE my daughter is married.
       CLOSED: [2016-08-18 四 17:31]
       :LOGBOOK:
       - State "DONE"       from "STARTED"    [2016-08-18 四 17:31]
       CLOCK: [2016-08-18 四 04:46]--[2016-08-18 四 17:31] => 12:45
       :END:

****** DONE 朗读《道德经》20余节
       CLOSED: [2016-08-19 五 07:03]
       :LOGBOOK:
       - State "DONE"       from "STARTED"    [2016-08-19 五 07:03]
       CLOCK: [2016-08-19 五 06:48]--[2016-08-19 五 07:03] =>  0:15
       :END:

**** DONE search Done is better than perfect.
     CLOSED: [2016-08-21 Sun 09:43]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-21 Sun 09:43]
     CLOCK: [2016-08-21 Sun 08:21]--[2016-08-21 Sun 09:43] =>  1:22
     :END:
Facebook的标语
http://www.ruanyifeng.com/blog/2012/02/facebook_slogans.html

七个对我最重要的职业建议（译文）
七个对我最好的职业建议（精简版）
作者：Nicholas C. Zakas
译者：阮一峰
原文网址：https://www.nczonline.net/blog/2013/10/15/the-best-career-advice-ive-received/

**** DONE arrive office begin work
     CLOSED: [2016-08-21 日 18:41]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-21 日 18:41]
     CLOCK: [2016-08-21 Sun 13:50]--[2016-08-21 Sun 13:51] =>  0:01
     :END:

**** DONE browse Yin wang's pages
     CLOSED: [2016-08-21 Sun 15:06]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-21 Sun 15:06]
     CLOCK: [2016-08-21 Sun 14:18]--[2016-08-21 Sun 15:06] =>  0:48
     :END:

**** DONE browse and learn
     CLOSED: [2016-08-21 Sun 18:28]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-21 Sun 18:28]
     CLOCK: [2016-08-21 Sun 17:41]--[2016-08-21 Sun 18:28] =>  0:47
     :END:
阅读程序猿的呐喊

**** DONE Elisp learning
     CLOSED: [2016-08-21 日 21:30]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-21 日 21:30]
     CLOCK: [2016-08-21 日 20:29]--[2016-08-21 日 21:30] =>  0:01
     :END:
begin learn Elisp and Ruby
**** DONE arrive office and begin clean in order
     CLOSED: [2016-08-22 一 08:33]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-22 一 08:33]
     CLOCK: [2016-08-22 一 07:47]--[2016-08-22 一 08:33] =>  0:46
     :END:

**** DONE 李玲来访
     CLOSED: [2016-08-25 四 11:15]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-25 四 11:15]
     CLOCK: [2016-08-25 四 9:20]--[2016-08-25 四 10:15] =>  0:55
     :END:

**** DONE 企业来访
     CLOSED: [2016-08-25 四 11:18]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-25 四 11:18]
     CLOCK: [2016-08-25 四 10:17]--[2016-08-25 四 11:18] =>  1:01
     :END:

** DONE arrive office and clean up
   CLOSED: [2016-08-23 二 08:14]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2016-08-23 二 08:14]
   CLOCK: [2016-08-23 二 07:42]--[2016-08-23 二 08:14] =>  0:32
   :END:
李强来访；陈书记来安排下午会议：先进评选
客观评价60%民主推荐40%
